class HomeController < ApplicationController
    def top
    end
    def help
    end
    def edit
        
        @bros_enemys = [
            "コイン(パラシュート付き)","10コイン(パラシュート付き)","くつクリボー","クイーンくつクリボー","クリボー","カキボー","ノコノコ(緑)","ノコノコ(赤)","メット","トゲメット","トゲゾー","パックンフラワー","ファイアパックン","ブラックパックン","ドッスン","チョロプー","ハンマーブロス","メガブロス","ワンワン","杭なしワンワン","ハナチャン","ボムへい","カロン","カメック","クッパクラウン","キラー砲台","砲台","Pスイッチ","POWブロック","ジャンプ台(縦)","ジャンプ台(横)",
        ]
        @bros_items = [
            "スーパーキノコ","ファイアフラワー","でかキノコ","スーパーボールフラワー","スーパースター","1UPキノコ","くさったキノコ"
        ]
        @bros_icicles = "ツララ"
        @bros_bosses = ["クッパ","クッパJr."]
        @bros_boomboom = "ブンブン"
        @bros3_enemys = [
            "コイン(パラシュート付き)","10コイン(パラシュート付き)","くつクリボー","クイーンくつクリボー","クリボー","カキボー","ノコノコ(緑)","ノコノコ(赤)","メット","トゲメット","トゲゾー","パックンフラワー","ファイアパックン","ブラックパックン","ドッスン","チョロプー","ハンマーブロス","メガブロス","ワンワン","杭なしワンワン","ハナチャン","ボムへい","カロン","カメック","クッパクラウン","キラー砲台","砲台","Pスイッチ","POWブロック","ジャンプ台(縦)","ジャンプ台(横)",
        ]
        @bros3_items = [
            "スーパーキノコ","ファイアフラワー","スーパースター","1UPキノコ"
        ]
        @world_enemys = [
            "コイン(パラシュート付き)","10コイン(パラシュート付き)","ヨッシー","クリボン","カキボン","ノコノコ(緑)","ノコノコ(赤)","メット","トゲメット","トゲゾー","ピーパックン","ファイアパックン","ブラックパックン","ドッスン","チョロプー","ハンマーブロス","メガブロス","ワンワン","杭なしワンワン","ハナチャン","ボムへい","カロン","カメック","クッパクラウン","キラー砲台","砲台","Pスイッチ","POWブロック","ジャンプ台(縦)","ジャンプ台(横)",
        ]
        @world_items = [
            "スーパーキノコ","ファイアフラワー","スーパースター","1UPキノコ"
        ]
        @brosU_enemys = [
            "コイン(パラシュート付き)","10コイン(パラシュート付き)","ヨッシー","クリボー","カキボー","ノコノコ(緑)","ノコノコ(赤)","メット","トゲメット","トゲゾー","パックンフラワー","ファイアパックン","ブラックパックン","ドッスン","チョロプー","ハンマーブロス","メガブロス","ワンワン","杭なしワンワン","ハナチャン","ボムへい","カロン","カメック","クッパクラウン","キラー砲台","砲台","Pスイッチ","POWブロック","ジャンプ台(縦)","ジャンプ台(横)",
        ]
        @brosU_items = [
            "スーパーキノコ","ファイアフラワー","スーパースター","1UPキノコ"
        ]
    end
    def save
    end
end
